<a href="https://colab.research.google.com/github/MANOJKUMARKONDURU/05_Machine-Learning_Nov10_2025/blob/main/01_Pandas_Nov10/02_Series/07_Using_Methods_Part_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#7.Using Methods Part-2

In [ ]:
import pandas as pd

In [ ]:
start_date_deposits = pd.Series({
    '7/4/2014': 2000,
    '8/15/2014': 1500,
    '9/10/2014': 1800,
    '10/5/2014': 2200,
    '11/1/2014': 1700,
    '12/25/2014': 2500,
    '1/10/2015': 1600,
    '2/14/2015': 1900,
    '3/17/2015': 2100,
    '4/1/2015': 2300,
    '5/5/2015': 2000,
    '6/20/2015': 2400,
    '7/4/2015': 2600,
    '8/30/2015': 1800,
    '9/15/2015': 2200,
    '10/31/2015': 2700,
})

In [ ]:
start_date_deposits

7/4/2014      2000
8/15/2014     1500
9/10/2014     1800
10/5/2014     2200
11/1/2014     1700
12/25/2014    2500
1/10/2015     1600
2/14/2015     1900
3/17/2015     2100
4/1/2015      2300
5/5/2015      2000
6/20/2015     2400
7/4/2015      2600
8/30/2015     1800
9/15/2015     2200
10/31/2015    2700
dtype: int64

In [ ]:
#.head() methods returns the first 5 rows of the dataset

start_date_deposits.head()

7/4/2014     2000
8/15/2014    1500
9/10/2014    1800
10/5/2014    2200
11/1/2014    1700
dtype: int64

In [ ]:
#.tail() methods returns the last 5 rows of the dataset
start_date_deposits.tail()

6/20/2015     2400
7/4/2015      2600
8/30/2015     1800
9/15/2015     2200
10/31/2015    2700
dtype: int64